---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CreatePartsWithoutDabasebase
source: html/958dfb81-31ae-31a9-44f2-1677d208b9cf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CreatePartsWithoutDabasebase Property

Parts were not created because fabrication configuration is not available.

## Syntax (C#)
```csharp
public static FailureDefinitionId CreatePartsWithoutDabasebase { get; }
```